brew "atuin"
brew "bat"
brew "btop"
#brew "docker"
#brew "docker-compose"
#brew "docker-buildx"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "glab"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tealdeer"
brew "ugrep"
brew "yq"
brew "zellij"
brew "zoxide"

if OS.mac?
  cask "1password"
  cask "1password-cli"
  cask "aws-vpn-client"
  cask "font-fira-code-nerd-font"
  cask "ghostty"
  cask "keepingyouawake"
  cask "rancher"
  cask "screen-studio"
  cask "visual-studio-code"
end

if OS.linux?
  flatpak "com.google.Chrome"
  flatpak "hu.irl.cameractrls"
end
