tap "homebrew/bundle"

brew "atuin"
brew "bat"
brew "eza"
brew "fd"
brew "gh"
brew "glab"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "ripgrep"
brew "stow"
brew "tealdeer"
brew "ugrep"
brew "yq"
brew "zellij"
brew "zoxide"

cast "1password"
cast "1password-cli"
cast "docker-desktop"
cast "font-fira-code-nerd-font"
cast "ghostty"
cast "google-chrome"
cast "keepingyouawake"
cast "raycast"
cast "screen-studio"
cast "signal"
cast "slack"
cast "spotify"
cast "visual-studio-code"
cast "zoom"
