tap "homebrew/bundle"

brew "atuin"
brew "bat"
brew "eza"
brew "fd"
brew "gh"
brew "glab"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "ripgrep"
brew "stow"
brew "tealdeer"
brew "ugrep"
brew "yq"
brew "zellij"
brew "zoxide"

cask "1password"
cask "1password-cli"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "keepingyouawake"
cask "raycask"
cask "screen-studio"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
