tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "puma/puma"
# Mozilla CA certificate store
brew "ca-certificates"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# General-purpose data compression with high compression ratio
brew "xz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# UI to create reproducible developer environments based on a devcontainer.json
cask "devpod"
# App to build and share containerised applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
mas "AdGuard for Safari", id: 1440147259
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-docker"
vscode "tamasfe.even-better-toml"
vscode "vscode-icons-team.vscode-icons"
