tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"

# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"

# Pack, ship and run any application as a lightweight container
brew "docker"

# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"

# Isolated development environments using Docker
brew "docker-compose"

# Command-line fuzzy finder written in Go
brew "fzf"

# GitHub command-line tool
brew "gh"

# Distributed revision control system
brew "git"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Cross-shell prompt for astronauts
brew "starship"

# Shell extension to navigate your filesystem faster
brew "zoxide"

# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Free app that makes your Internet safer
cask "cloudflare-warp"

# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

# Control your tools with a few keystrokes
cask "raycast"

# Open-source code editor
cask "visual-studio-code"
vscode "dracula-theme.theme-dracula"
vscode "vscode-icons-team.vscode-icons"
vscode "tamasfe.even-better-toml"
